**`teams/delius-iaps/iaps_server`** terragrunt plan on `pull_request` event [#319](${url})

```
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Reading...
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Read complete after 1s
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Reading...
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Read complete after 2s
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Reading...
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_caller_identity.current: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["ec2launch-v2-windows"]: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["amazon-cloudwatch-agent-windows"]: Reading...
module.imagebuilder.data.aws_caller_identity.current: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Reading...
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["amazon-cloudwatch-agent-windows"]: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["ec2launch-v2-windows"]: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_oracle_db_client_tools.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_distribution_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_configure_cloudwatch_agent.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_im_interface.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["add_net_framework_features.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_configure_odbcdns.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_oracle_sql_developer.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_ndelius_interface.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_base_packages.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_set_system_locale.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_recipe.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_pipeline.this: Refreshing state... [id=<REDACTED>]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.imagebuilder.aws_imagebuilder_component.this["add_net_framework_features.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/add-net-framework-features/0.2.0/1"
        name                  = "add_net_framework_features"
      ~ tags                  = {
            "add_net_framework_features-version"                 = "0.2.0"
            "amazon-cloudwatch-agent-windows-version"            = "1.0.0"
            "application"                                        = "DELIUS-IAPS"
            "branch"                                             = "main"
            "business-unit"                                      = "HMPPS"
            "delius_iaps_configure_cloudwatch_agent-version"     = "0.1.1"
            "delius_iaps_configure_odbc_dsn-version"             = "0.1.0"
            "delius_iaps_install_base_packages-version"          = "0.1.10"
            "delius_iaps_install_im_interface-version"           = "0.1.1"
            "delius_iaps_install_ndelius_interface-version"      = "0.1.4"
            "delius_iaps_install_oracle_db_client_tools-version" = "0.1.1"
            "delius_iaps_install_oracle_sql_developer-version"   = "0.1.5"
            "delius_iaps_set_system_locale-version"              = "0.1.1"
            "ec2launch-v2-windows-version"                       = "1.0.0"
            "image-pipeline"                                     = "delius_iaps_server"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
            "is-production"                                      = "true"
            "os-version"                                         = "windows server 2022"
            "owner"                                              = "Probation Webops: probation-webops@digital.justice.gov.uk"
            "release-or-patch"                                   = "patch"
            "source-code"                                        = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-iaps"
        }
      ~ tags_all              = {
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
            # (20 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_configure_cloudwatch_agent.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-configure-cloudwatch-agent/0.1.1/1"
        name                  = "delius_iaps_configure_cloudwatch_agent"
      ~ tags                  = {
            "add_net_framework_features-version"                 = "0.2.0"
            "amazon-cloudwatch-agent-windows-version"            = "1.0.0"
            "application"                                        = "DELIUS-IAPS"
            "branch"                                             = "main"
            "business-unit"                                      = "HMPPS"
            "delius_iaps_configure_cloudwatch_agent-version"     = "0.1.1"
            "delius_iaps_configure_odbc_dsn-version"             = "0.1.0"
            "delius_iaps_install_base_packages-version"          = "0.1.10"
            "delius_iaps_install_im_interface-version"           = "0.1.1"
            "delius_iaps_install_ndelius_interface-version"      = "0.1.4"
            "delius_iaps_install_oracle_db_client_tools-version" = "0.1.1"
            "delius_iaps_install_oracle_sql_developer-version"   = "0.1.5"
            "delius_iaps_set_system_locale-version"              = "0.1.1"
            "ec2launch-v2-windows-version"                       = "1.0.0"
            "image-pipeline"                                     = "delius_iaps_server"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
            "is-production"                                      = "true"
            "os-version"                                         = "windows server 2022"
            "owner"                                              = "Probation Webops: probation-webops@digital.justice.gov.uk"
            "release-or-patch"                                   = "patch"
            "source-code"                                        = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-iaps"
        }
      ~ tags_all              = {
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
            # (20 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_configure_odbcdns.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-configure-odbc-dsn/0.1.0/1"
        name                  = "delius_iaps_configure_odbc_dsn"
      ~ tags                  = {
            "add_net_framework_features-version"                 = "0.2.0"
            "amazon-cloudwatch-agent-windows-version"            = "1.0.0"
            "application"                                        = "DELIUS-IAPS"
            "branch"                                             = "main"
            "business-unit"                                      = "HMPPS"
            "delius_iaps_configure_cloudwatch_agent-version"     = "0.1.1"
            "delius_iaps_configure_odbc_dsn-version"             = "0.1.0"
            "delius_iaps_install_base_packages-version"          = "0.1.10"
            "delius_iaps_install_im_interface-version"           = "0.1.1"
            "delius_iaps_install_ndelius_interface-version"      = "0.1.4"
            "delius_iaps_install_oracle_db_client_tools-version" = "0.1.1"
            "delius_iaps_install_oracle_sql_developer-version"   = "0.1.5"
            "delius_iaps_set_system_locale-version"              = "0.1.1"
            "ec2launch-v2-windows-version"                       = "1.0.0"
            "image-pipeline"                                     = "delius_iaps_server"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
            "is-production"                                      = "true"
            "os-version"                                         = "windows server 2022"
            "owner"                                              = "Probation Webops: probation-webops@digital.justice.gov.uk"
            "release-or-patch"                                   = "patch"
            "source-code"                                        = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-iaps"
        }
      ~ tags_all              = {
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
            # (20 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_base_packages.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-base-packages/0.1.10/1"
        name                  = "delius_iaps_install_base_packages"
      ~ tags                  = {
            "add_net_framework_features-version"                 = "0.2.0"
            "amazon-cloudwatch-agent-windows-version"            = "1.0.0"
            "application"                                        = "DELIUS-IAPS"
            "branch"                                             = "main"
            "business-unit"                                      = "HMPPS"
            "delius_iaps_configure_cloudwatch_agent-version"     = "0.1.1"
            "delius_iaps_configure_odbc_dsn-version"             = "0.1.0"
            "delius_iaps_install_base_packages-version"          = "0.1.10"
            "delius_iaps_install_im_interface-version"           = "0.1.1"
            "delius_iaps_install_ndelius_interface-version"      = "0.1.4"
            "delius_iaps_install_oracle_db_client_tools-version" = "0.1.1"
            "delius_iaps_install_oracle_sql_developer-version"   = "0.1.5"
            "delius_iaps_set_system_locale-version"              = "0.1.1"
            "ec2launch-v2-windows-version"                       = "1.0.0"
            "image-pipeline"                                     = "delius_iaps_server"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
            "is-production"                                      = "true"
            "os-version"                                         = "windows server 2022"
            "owner"                                              = "Probation Webops: probation-webops@digital.justice.gov.uk"
            "release-or-patch"                                   = "patch"
            "source-code"                                        = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-iaps"
        }
      ~ tags_all              = {
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
            # (20 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_im_interface.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-im-interface/0.1.1/1"
        name                  = "delius_iaps_install_im_interface"
      ~ tags                  = {
            "add_net_framework_features-version"                 = "0.2.0"
            "amazon-cloudwatch-agent-windows-version"            = "1.0.0"
            "application"                                        = "DELIUS-IAPS"
            "branch"                                             = "main"
            "business-unit"                                      = "HMPPS"
            "delius_iaps_configure_cloudwatch_agent-version"     = "0.1.1"
            "delius_iaps_configure_odbc_dsn-version"             = "0.1.0"
            "delius_iaps_install_base_packages-version"          = "0.1.10"
            "delius_iaps_install_im_interface-version"           = "0.1.1"
            "delius_iaps_install_ndelius_interface-version"      = "0.1.4"
            "delius_iaps_install_oracle_db_client_tools-version" = "0.1.1"
            "delius_iaps_install_oracle_sql_developer-version"   = "0.1.5"
            "delius_iaps_set_system_locale-version"              = "0.1.1"
            "ec2launch-v2-windows-version"                       = "1.0.0"
            "image-pipeline"                                     = "delius_iaps_server"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
            "is-production"                                      = "true"
            "os-version"                                         = "windows server 2022"
            "owner"                                              = "Probation Webops: probation-webops@digital.justice.gov.uk"
            "release-or-patch"                                   = "patch"
            "source-code"                                        = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-iaps"
        }
      ~ tags_all              = {
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
            # (20 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_ndelius_interface.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-ndelius-interface/0.1.4/1"
        name                  = "delius_iaps_install_ndelius_interface"
      ~ tags                  = {
            "add_net_framework_features-version"                 = "0.2.0"
            "amazon-cloudwatch-agent-windows-version"            = "1.0.0"
            "application"                                        = "DELIUS-IAPS"
            "branch"                                             = "main"
            "business-unit"                                      = "HMPPS"
            "delius_iaps_configure_cloudwatch_agent-version"     = "0.1.1"
            "delius_iaps_configure_odbc_dsn-version"             = "0.1.0"
            "delius_iaps_install_base_packages-version"          = "0.1.10"
            "delius_iaps_install_im_interface-version"           = "0.1.1"
            "delius_iaps_install_ndelius_interface-version"      = "0.1.4"
            "delius_iaps_install_oracle_db_client_tools-version" = "0.1.1"
            "delius_iaps_install_oracle_sql_developer-version"   = "0.1.5"
            "delius_iaps_set_system_locale-version"              = "0.1.1"
            "ec2launch-v2-windows-version"                       = "1.0.0"
            "image-pipeline"                                     = "delius_iaps_server"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
            "is-production"                                      = "true"
            "os-version"                                         = "windows server 2022"
            "owner"                                              = "Probation Webops: probation-webops@digital.justice.gov.uk"
            "release-or-patch"                                   = "patch"
            "source-code"                                        = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-iaps"
        }
      ~ tags_all              = {
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
            # (20 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_oracle_db_client_tools.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-oracle-db-client-tools/0.1.1/1"
        name                  = "delius_iaps_install_oracle_db_client_tools"
      ~ tags                  = {
            "add_net_framework_features-version"                 = "0.2.0"
            "amazon-cloudwatch-agent-windows-version"            = "1.0.0"
            "application"                                        = "DELIUS-IAPS"
            "branch"                                             = "main"
            "business-unit"                                      = "HMPPS"
            "delius_iaps_configure_cloudwatch_agent-version"     = "0.1.1"
            "delius_iaps_configure_odbc_dsn-version"             = "0.1.0"
            "delius_iaps_install_base_packages-version"          = "0.1.10"
            "delius_iaps_install_im_interface-version"           = "0.1.1"
            "delius_iaps_install_ndelius_interface-version"      = "0.1.4"
            "delius_iaps_install_oracle_db_client_tools-version" = "0.1.1"
            "delius_iaps_install_oracle_sql_developer-version"   = "0.1.5"
            "delius_iaps_set_system_locale-version"              = "0.1.1"
            "ec2launch-v2-windows-version"                       = "1.0.0"
            "image-pipeline"                                     = "delius_iaps_server"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
            "is-production"                                      = "true"
            "os-version"                                         = "windows server 2022"
            "owner"                                              = "Probation Webops: probation-webops@digital.justice.gov.uk"
            "release-or-patch"                                   = "patch"
            "source-code"                                        = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-iaps"
        }
      ~ tags_all              = {
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
            # (20 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_oracle_sql_developer.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-oracle-sql-developer/0.1.5/1"
        name                  = "delius_iaps_install_oracle_sql_developer"
      ~ tags                  = {
            "add_net_framework_features-version"                 = "0.2.0"
            "amazon-cloudwatch-agent-windows-version"            = "1.0.0"
            "application"                                        = "DELIUS-IAPS"
            "branch"                                             = "main"
            "business-unit"                                      = "HMPPS"
            "delius_iaps_configure_cloudwatch_agent-version"     = "0.1.1"
            "delius_iaps_configure_odbc_dsn-version"             = "0.1.0"
            "delius_iaps_install_base_packages-version"          = "0.1.10"
            "delius_iaps_install_im_interface-version"           = "0.1.1"
            "delius_iaps_install_ndelius_interface-version"      = "0.1.4"
            "delius_iaps_install_oracle_db_client_tools-version" = "0.1.1"
            "delius_iaps_install_oracle_sql_developer-version"   = "0.1.5"
            "delius_iaps_set_system_locale-version"              = "0.1.1"
            "ec2launch-v2-windows-version"                       = "1.0.0"
            "image-pipeline"                                     = "delius_iaps_server"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
            "is-production"                                      = "true"
            "os-version"                                         = "windows server 2022"
            "owner"                                              = "Probation Webops: probation-webops@digital.justice.gov.uk"
            "release-or-patch"                                   = "patch"
            "source-code"                                        = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-iaps"
        }
      ~ tags_all              = {
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
            # (20 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_set_system_locale.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-set-system-locale/0.1.1/1"
        name                  = "delius_iaps_set_system_locale"
      ~ tags                  = {
            "add_net_framework_features-version"                 = "0.2.0"
            "amazon-cloudwatch-agent-windows-version"            = "1.0.0"
            "application"                                        = "DELIUS-IAPS"
            "branch"                                             = "main"
            "business-unit"                                      = "HMPPS"
            "delius_iaps_configure_cloudwatch_agent-version"     = "0.1.1"
            "delius_iaps_configure_odbc_dsn-version"             = "0.1.0"
            "delius_iaps_install_base_packages-version"          = "0.1.10"
            "delius_iaps_install_im_interface-version"           = "0.1.1"
            "delius_iaps_install_ndelius_interface-version"      = "0.1.4"
            "delius_iaps_install_oracle_db_client_tools-version" = "0.1.1"
            "delius_iaps_install_oracle_sql_developer-version"   = "0.1.5"
            "delius_iaps_set_system_locale-version"              = "0.1.1"
            "ec2launch-v2-windows-version"                       = "1.0.0"
            "image-pipeline"                                     = "delius_iaps_server"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
            "is-production"                                      = "true"
            "os-version"                                         = "windows server 2022"
            "owner"                                              = "Probation Webops: probation-webops@digital.justice.gov.uk"
            "release-or-patch"                                   = "patch"
            "source-code"                                        = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-iaps"
        }
      ~ tags_all              = {
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
            # (20 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_distribution_configuration.this will be updated in-place
  ~ resource "aws_imagebuilder_distribution_configuration" "this" {
        id           = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/delius-iaps-server"
        name         = "delius_iaps_server"
      ~ tags         = {
            "add_net_framework_features-version"                 = "0.2.0"
            "amazon-cloudwatch-agent-windows-version"            = "1.0.0"
            "application"                                        = "DELIUS-IAPS"
            "branch"                                             = "main"
            "business-unit"                                      = "HMPPS"
            "delius_iaps_configure_cloudwatch_agent-version"     = "0.1.1"
            "delius_iaps_configure_odbc_dsn-version"             = "0.1.0"
            "delius_iaps_install_base_packages-version"          = "0.1.10"
            "delius_iaps_install_im_interface-version"           = "0.1.1"
            "delius_iaps_install_ndelius_interface-version"      = "0.1.4"
            "delius_iaps_install_oracle_db_client_tools-version" = "0.1.1"
            "delius_iaps_install_oracle_sql_developer-version"   = "0.1.5"
            "delius_iaps_set_system_locale-version"              = "0.1.1"
            "ec2launch-v2-windows-version"                       = "1.0.0"
            "image-pipeline"                                     = "delius_iaps_server"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
            "is-production"                                      = "true"
            "os-version"                                         = "windows server 2022"
            "owner"                                              = "Probation Webops: probation-webops@digital.justice.gov.uk"
            "release-or-patch"                                   = "patch"
            "source-code"                                        = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-iaps"
        }
      ~ tags_all     = {
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
            # (20 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      - distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_pipeline.this must be replaced
-/+ resource "aws_imagebuilder_image_pipeline" "this" {
      ~ arn                              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/delius-iaps-server" -> (known after apply)
      ~ date_created                     = "2023-05-02T13:42:12.499Z" -> (known after apply)
      ~ date_last_run                    = "2023-09-02T00:00:28.673Z" -> (known after apply)
      ~ date_next_run                    = "2023-11-02T00:00:00.000Z" -> (known after apply)
      ~ date_updated                     = "2023-05-02T13:42:12.499Z" -> (known after apply)
      ~ id                               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/delius-iaps-server" -> (known after apply)
      ~ image_recipe_arn                 = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/delius-iaps-server/0.0.31" # forces replacement -> (known after apply) # forces replacement
      ~ infrastructure_configuration_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/delius-iaps-server-0-0-31" -> (known after apply)
        name                             = "delius_iaps_server"
      ~ platform                         = "Windows" -> (known after apply)
      ~ tags                             = {
            "add_net_framework_features-version"                 = "0.2.0"
            "amazon-cloudwatch-agent-windows-version"            = "1.0.0"
            "application"                                        = "DELIUS-IAPS"
            "branch"                                             = "main"
            "business-unit"                                      = "HMPPS"
            "delius_iaps_configure_cloudwatch_agent-version"     = "0.1.1"
            "delius_iaps_configure_odbc_dsn-version"             = "0.1.0"
            "delius_iaps_install_base_packages-version"          = "0.1.10"
            "delius_iaps_install_im_interface-version"           = "0.1.1"
            "delius_iaps_install_ndelius_interface-version"      = "0.1.4"
            "delius_iaps_install_oracle_db_client_tools-version" = "0.1.1"
            "delius_iaps_install_oracle_sql_developer-version"   = "0.1.5"
            "delius_iaps_set_system_locale-version"              = "0.1.1"
            "ec2launch-v2-windows-version"                       = "1.0.0"
            "image-pipeline"                                     = "delius_iaps_server"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
            "is-production"                                      = "true"
            "os-version"                                         = "windows server 2022"
            "owner"                                              = "Probation Webops: probation-webops@digital.justice.gov.uk"
            "release-or-patch"                                   = "patch"
            "source-code"                                        = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-iaps"
        }
      ~ tags_all                         = {
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
            # (20 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ schedule {
          + timezone                           = (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.imagebuilder.aws_imagebuilder_image_recipe.this must be replaced
+/- resource "aws_imagebuilder_image_recipe" "this" {
      ~ arn              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/delius-iaps-server/0.0.31" -> (known after apply)
      ~ date_created     = "2023-05-02T13:42:11.325Z" -> (known after apply)
      ~ id               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/delius-iaps-server/0.0.31" -> (known after apply)
        name             = "delius_iaps_server"
      ~ owner            = "374269020027" -> (known after apply)
      ~ platform         = "Windows" -> (known after apply)
      ~ tags             = {
            "add_net_framework_features-version"                 = "0.2.0"
            "amazon-cloudwatch-agent-windows-version"            = "1.0.0"
            "application"                                        = "DELIUS-IAPS"
            "branch"                                             = "main"
            "business-unit"                                      = "HMPPS"
            "delius_iaps_configure_cloudwatch_agent-version"     = "0.1.1"
            "delius_iaps_configure_odbc_dsn-version"             = "0.1.0"
            "delius_iaps_install_base_packages-version"          = "0.1.10"
            "delius_iaps_install_im_interface-version"           = "0.1.1"
            "delius_iaps_install_ndelius_interface-version"      = "0.1.4"
            "delius_iaps_install_oracle_db_client_tools-version" = "0.1.1"
            "delius_iaps_install_oracle_sql_developer-version"   = "0.1.5"
            "delius_iaps_set_system_locale-version"              = "0.1.1"
            "ec2launch-v2-windows-version"                       = "1.0.0"
            "image-pipeline"                                     = "delius_iaps_server"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
            "is-production"                                      = "true"
            "os-version"                                         = "windows server 2022"
            "owner"                                              = "Probation Webops: probation-webops@digital.justice.gov.uk"
            "release-or-patch"                                   = "patch"
            "source-code"                                        = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-iaps"
        }
      ~ tags_all         = {
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
            # (20 unchanged elements hidden)
        }
      + user_data_base64 = (known after apply)
      ~ version          = "0.0.31" -> "0.0.32" # forces replacement
        # (2 unchanged attributes hidden)

      - block_device_mapping {
          - device_name = "/dev/sda1" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 30 -> null
              - volume_type           = "gp3" -> null
            }
        }
      - block_device_mapping {
          - device_name = "/dev/xvdf" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - snapshot_id           = "snap-04435aa8246764616" -> null
              - throughput            = 0 -> null
              - volume_size           = 7 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 30
              + volume_type           = "gp3"
            }
        }
      + block_device_mapping {
          + device_name = "/dev/xvdf"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + snapshot_id           = "snap-04435aa8246764616"
              + volume_size           = 7
              + volume_type           = "gp3"
            }
        }

        # (11 unchanged blocks hidden)
    }

  # module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this must be replaced
-/+ resource "aws_imagebuilder_infrastructure_configuration" "this" {
      ~ arn                           = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/delius-iaps-server-0-0-31" -> (known after apply)
      ~ date_created                  = "2023-05-02T13:42:07.758Z" -> (known after apply)
      ~ date_updated                  = "2023-10-18T08:16:07.624Z" -> (known after apply)
      ~ id                            = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/delius-iaps-server-0-0-31" -> (known after apply)
      ~ name                          = "delius_iaps_server_0_0_31" -> "delius_iaps_server_0_0_32" # forces replacement
      ~ resource_tags                 = {
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
            # (20 unchanged elements hidden)
        }
      ~ tags                          = {
            "add_net_framework_features-version"                 = "0.2.0"
            "amazon-cloudwatch-agent-windows-version"            = "1.0.0"
            "application"                                        = "DELIUS-IAPS"
            "branch"                                             = "main"
            "business-unit"                                      = "HMPPS"
            "delius_iaps_configure_cloudwatch_agent-version"     = "0.1.1"
            "delius_iaps_configure_odbc_dsn-version"             = "0.1.0"
            "delius_iaps_install_base_packages-version"          = "0.1.10"
            "delius_iaps_install_im_interface-version"           = "0.1.1"
            "delius_iaps_install_ndelius_interface-version"      = "0.1.4"
            "delius_iaps_install_oracle_db_client_tools-version" = "0.1.1"
            "delius_iaps_install_oracle_sql_developer-version"   = "0.1.5"
            "delius_iaps_set_system_locale-version"              = "0.1.1"
            "ec2launch-v2-windows-version"                       = "1.0.0"
            "image-pipeline"                                     = "delius_iaps_server"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
            "is-production"                                      = "true"
            "os-version"                                         = "windows server 2022"
            "owner"                                              = "Probation Webops: probation-webops@digital.justice.gov.uk"
            "release-or-patch"                                   = "patch"
            "source-code"                                        = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-iaps"
        }
      ~ tags_all                      = {
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.31" -> "delius_iaps_server/0.0.32"
            # (20 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 10 to change, 3 to destroy.

```
